chenyurong22/STM32-EC200-Firmware/src/modem.c
/*
 * modem.c  —  EC200U MQTT driver for STM32G071 (PlatformIO / STM32Cube HAL)
 *
 * Replaces the SMS-based relay control with MQTT over 4G LTE.
 *
 * UART wiring (from your stm32g0xx_hal_msp.c):
 *   USART1  PB6=TX  PB7=RX  →  EC200U
 *   USART2  PA2=TX  PA3=RX  →  debug serial monitor (115200)
 *
 * HiveMQ Cloud broker  :  44ad82d486654d68b4ac738e12fb1236.s1.eu.hivemq.cloud:8883
 * Firebase project     :  pump-controller-4398d
 *
 * MQTT topics  (PUMP_ID = "01" for pump 1, "02" for pump 2):
 *   pump/01/status   ← STM32 publishes on state change / 60 s heartbeat
 *   pump/01/alerts   ← STM32 publishes on protection trip
 *   pump/01/cmd      → STM32 subscribes (relay on/off commands)
 *
 * Payload examples:
 *   status : {"relay1_state":1,"relay2_state":0,"v1":415.2,"v2":414.8,
 *              "v3":416.1,"current":12.4,"dry_run":false,"online":true}
 *   cmd    : {"relay1":1,"relay2":0}
 *   alerts : {"overvoltage":false,"undervoltage":false,
 *              "phase_loss":false,"dry_run_trip":true}
 */

#include "modem.h"
#include "modbus.h"
#include "main.h"
#include "ota.h"
#include <string.h>
#include <stdio.h>
#include <stdlib.h>

/* IWDG handle lives in main.c — refresh it inside long blocking delays */
extern IWDG_HandleTypeDef hiwdg;
extern volatile uint8_t g_boot_phase;
extern const char g_fw_ver[];

/* ═══════════════════════════════════════════════════════════════════════════
 * USER CONFIG  —  change these two lines per device before flashing
 * ═══════════════════════════════════════════════════════════════════════════ */
#define PUMP_ID "01"                 /* "01" for pump 1, "02" for pump 2  */
#define MQTT_USERNAME "pump01"       /* EMQX Cloud credentials             */
#define MQTT_PASSWORD "Light@2026"

/* ── APN — change to your SIM card ─────────────────────────────────────── */
/* Airtel: "airtelgprs.com"   Jio: "jionet"   BSNL: "bsnlnet"             */
#define SIM_APN "airtelgprs.com"

/* ── Broker ─────────────────────────────────────────────────────────────── */
#define BROKER_HOST "z9c698f0.ala.asia-southeast1.emqxsl.com"
#define BROKER_PORT "8883"
#define CLIENT_ID "pump" PUMP_ID

/* ── Topics ─────────────────────────────────────────────────────────────── */
#define TOPIC_STATUS   "pump/" PUMP_ID "/status"
#define TOPIC_CMD      "pump/" PUMP_ID "/cmd"
#define TOPIC_ALERTS   "pump/" PUMP_ID "/alerts"
#define TOPIC_OTA      "pump/" PUMP_ID "/ota"
#define TOPIC_SETTINGS "pump/" PUMP_ID "/settings"
#define TOPIC_LOG      "pump/" PUMP_ID "/log"
/* pump02 — same STM32, separate MQTT device (relay2 = PB4/PB5) */
#define TOPIC_CMD2     "pump/02/cmd"
#define TOPIC_STATUS2  "pump/02/status"

/* ── Protection thresholds — runtime configurable via TOPIC_SETTINGS ─────── */
static float cfg_ov    = 480.0f; /* V  — any L-N above this trips relay    */
static float cfg_uv    = 340.0f; /* V  — any L-N below this trips relay    */
static float cfg_pl    = 200.0f; /* V  — L-N below this = phase lost       */
static float cfg_dry_i = 1.5f;   /* A  — below this = dry running          */
static int   cfg_dry_t = 8;      /* s  — consecutive seconds before trip   */
static int   cfg_hp     = 0;     /* pump rating: 5=5HP 75=7.5HP 0=custom   */
static int   cfg_dry_en = 1;    /* 1=dry-run enabled  0=disabled           */
#define LOCKOUT_MS 300000UL       /* 5 min lockout after dry-run trip       */

/* ── Heartbeat interval (event-driven: also publish on every state change) ── */
#define HEARTBEAT_INTERVAL_MS 10000UL   /* publish status every 10 s */
/* QoS0 PUBEX acks can arrive late when modem/network is busy. */
#define MQTT_PUBACK_TIMEOUT_MS 12000UL
#define OTA_POST_QMTCLOSE_DELAY_MS 8000UL
#define OTA_HTTP_REDIRECT_ENABLED 0  /* firmware served from Railway — no redirect */
/* Block immediate OTA retrigger for a while after modem reboot during OTA.
 * This avoids retained pump/01/ota payload causing endless retry loops. */
#define OTA_RETRY_BLOCK_MS 300000UL
/* Raw line tracing is very chatty and can starve UART servicing at 9600 debug. */
#define MODEM_TRACE_LINES 0

/* ── RX buffer ──────────────────────────────────────────────────────────── */
#define RX_BUF_SIZE 512

/* ═══════════════════════════════════════════════════════════════════════════
 * Internal state
 * ═══════════════════════════════════════════════════════════════════════════ */

typedef enum
{
    MQTT_STATE_BOOT,         /* waiting for EC200U power-on            */
    MQTT_STATE_NET_WAIT,     /* waiting for network registration       */
    MQTT_STATE_PDP_OPEN,     /* send AT+QICSGP, wait OK               */
    MQTT_STATE_PDP_ACTIVATE, /* send AT+QIACT=1, wait OK              */
    MQTT_STATE_SSL_CFG,      /* configuring SSL for port 8883          */
    MQTT_STATE_BROKER_OPEN,  /* AT+QMTOPEN — TCP to broker             */
    MQTT_STATE_CONNECTING,   /* AT+QMTCONN — MQTT handshake            */
    MQTT_STATE_SUBSCRIBING,  /* AT+QMTSUB  — subscribe to cmd topic    */
    MQTT_STATE_CONNECTED,    /* fully operational                      */
    MQTT_STATE_PUBLISHING,   /* waiting for '>' prompt after PUBEX     */
    MQTT_STATE_PUB_WAIT_OK,  /* waiting for +QMTPUBEX: 0,0,0          */
    MQTT_STATE_DISCONNECTED, /* lost connection — will reconnect       */
} MqttState;

static UART_HandleTypeDef *modem_uart;
static MqttState mqtt_state = MQTT_STATE_BOOT;
static char rxbuf[RX_BUF_SIZE];
static size_t rxpos = 0;
static uint32_t state_entered_ms = 0;

/* relay + protection */
static bool     relay1 = false;
static bool     relay2 = false;
static uint32_t relay1_on_tick = 0;  /* HAL_GetTick() when relay1 last turned ON */
static uint32_t relay2_on_tick = 0;  /* HAL_GetTick() when relay2 last turned ON */
static bool recv_payload_pending = false; /* true when +QMTRECV payload on next line */
static char recv_pending_topic[48] = ""; /* topic of pending split-line payload     */
static uint8_t dry_run_count = 0;
static bool dry_run_tripped = false;
static uint32_t lockout_until = 0;

/* publish queue — one pending payload at a time */
static char pub_topic[48];
static char pub_payload[300];
static bool pub_pending = false;

/* OTA error saved here so it survives MQTT reconnect (heartbeat would overwrite pub_pending) */
static char ota_error_msg[80];
static bool force_status_after_ota = false;

/* event-driven publish: track previous state to detect changes */
static uint32_t last_heartbeat_ms  = 0;
static bool     prev_relay1        = false;
static bool     prev_relay2        = false;
static bool     prev_dry_run_trip  = false;

/* signal strength: updated by +CSQ response; 99 = unknown */
static int8_t   last_rssi          = 99;
static uint32_t ota_retry_block_until = 0;
/* Grace period: suppress modem_reinit for 20s after Modem_Init returns.
 * EC200U post-CFUN=1,1 boot may send late URCs (APP RDY) that arrive during
 * the SSL/MQTT config phase — these must not trigger a spurious modem_reinit. */
static uint32_t modem_init_grace_until = 0;

