chenyurong22/STM32-EC200-Firmware/src/modem.c
static void queue_publish(const char *topic, const char *payload)
{
    if (pub_pending)
        return; /* drop if previous not sent yet      */

    strncpy(pub_topic, topic, sizeof(pub_topic) - 1);
    strncpy(pub_payload, payload, sizeof(pub_payload) - 1);
    pub_topic[sizeof(pub_topic) - 1] = '\0';
    pub_payload[sizeof(pub_payload) - 1] = '\0';
    pub_pending = true;
}

/* Format float to 1 decimal place without requiring -u_printf_float.
 * Handles negative values and clamps out-of-range to "0.0".           */
static void fmt_f1(char *out, int sz, float v)
{
    if (v != v || v > 99999.0f || v < -9999.0f) { snprintf(out, sz, "0.0"); return; }
    int neg = (v < 0.0f);
    float a = neg ? -v : v;
    int   w = (int)a;
    int   d = (int)((a - (float)w) * 10.0f);
    if (neg) snprintf(out, sz, "-%d.%d",  w, d);
    else     snprintf(out, sz,  "%d.%d",  w, d);
}

static void fmt_f2(char *out, int sz, float v)
{
    if (v != v || v > 9999.0f || v < -999.0f) { snprintf(out, sz, "0.00"); return; }
    int neg = (v < 0.0f);
    float a = neg ? -v : v;
    int   w = (int)a;
    int   d = (int)((a - (float)w) * 100.0f);
    if (neg) snprintf(out, sz, "-%d.%02d", w, d);
    else     snprintf(out, sz,  "%d.%02d", w, d);
}

static void publish_status(void)
{
    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    float i  = Sensor_ReadCurrentACS712();

    char sv1[12], sv2[12], sv3[12], sci[12];
    fmt_f1(sv1, sizeof(sv1), v1);
    fmt_f1(sv2, sizeof(sv2), v2);
    fmt_f1(sv3, sizeof(sv3), v3);
    fmt_f2(sci, sizeof(sci), i);

    char scfg_ov[10], scfg_uv[10], scfg_pl[10], scfg_dry_i[10];
    fmt_f1(scfg_ov,    sizeof(scfg_ov),    cfg_ov);
    fmt_f1(scfg_uv,    sizeof(scfg_uv),    cfg_uv);
    fmt_f1(scfg_pl,    sizeof(scfg_pl),    cfg_pl);
    fmt_f2(scfg_dry_i, sizeof(scfg_dry_i), cfg_dry_i);

    char payload[440];
    snprintf(payload, sizeof(payload),
             "{\"relay1_state\":%d,\"relay2_state\":%d,"
             "\"v1\":%s,\"v2\":%s,\"v3\":%s,"
             "\"current\":%s,"
             "\"dry_run\":%s,\"online\":true,"
             "\"mb_ok\":%d,\"mb_rx\":%d,\"rssi\":%d,\"boot_phase\":%u,"
             "\"fw\":\"%s\","
             "\"cfg_ov\":%s,\"cfg_uv\":%s,\"cfg_pl\":%s,"
             "\"cfg_dry_i\":%s,\"cfg_dry_t\":%d,\"cfg_hp\":%d,\"cfg_dry_en\":%d}",
             relay1 ? 1 : 0,
             relay2 ? 1 : 0,
             sv1, sv2, sv3, sci,
             dry_run_tripped ? "true" : "false",
             Modbus_IsDataValid() ? 1 : 0,
             (int)Modbus_GetLastRx(),
             (int)last_rssi,
             (unsigned)g_boot_phase,
             g_fw_ver,
             scfg_ov, scfg_uv, scfg_pl, scfg_dry_i, cfg_dry_t, cfg_hp, cfg_dry_en);

    queue_publish(TOPIC_STATUS, payload);
}

static void publish_status2(void)
{
    /* pump02 status — relay1_state maps to physical relay2 (PB4/PB5) */
    char payload[48];
    snprintf(payload, sizeof(payload),
             "{\"relay1_state\":%d,\"online\":true}",
             relay2 ? 1 : 0);
    queue_publish(TOPIC_STATUS2, payload);
}

static void publish_alert(bool ov, bool uv, bool pl, bool dr)
{
    char payload[128];
    snprintf(payload, sizeof(payload),
             "{\"overvoltage\":%s,\"undervoltage\":%s,"
             "\"phase_loss\":%s,\"dry_run_trip\":%s}",
             ov ? "true" : "false",
             uv ? "true" : "false",
             pl ? "true" : "false",
             dr ? "true" : "false");

    queue_publish(TOPIC_ALERTS, payload);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Relay log — publishes on/off events to TOPIC_LOG
 * ═══════════════════════════════════════════════════════════════════════════ */

static void log_relay_event(int relay_num, bool on, const char *reason)
{
    char payload[96];
    uint32_t *on_tick = (relay_num == 2) ? &relay2_on_tick : &relay1_on_tick;
    if (on) {
        *on_tick = HAL_GetTick();
        snprintf(payload, sizeof(payload),
                 "{\"event\":\"on\",\"reason\":\"%s\",\"relay\":%d}", reason, relay_num);
    } else {
        uint32_t run_s = *on_tick ? (HAL_GetTick() - *on_tick) / 1000 : 0;
        *on_tick = 0;
        snprintf(payload, sizeof(payload),
                 "{\"event\":\"off\",\"reason\":\"%s\",\"run_s\":%lu,\"relay\":%d}",
                 reason, (unsigned long)run_s, relay_num);
    }
    queue_publish(TOPIC_LOG, payload);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Protection logic  — called every 1 s when connected
 * ═══════════════════════════════════════════════════════════════════════════ */

static void run_protection(void)
{
    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    float i = Sensor_ReadCurrentACS712();

    bool ov = (v1 > cfg_ov || v2 > cfg_ov || v3 > cfg_ov);
    bool uv = (v1 < cfg_uv || v2 < cfg_uv || v3 < cfg_uv);
    bool pl = (v1 < cfg_pl || v2 < cfg_pl || v3 < cfg_pl);

    /* voltage protection disabled until meter wiring verified
    if ((ov || uv || pl) && relay1)
    {
        Relay1_Set(false);
        Relay2_Set(true);
        log_relay_event(1, false, ov ? "overvoltage" : (uv ? "undervoltage" : "phase_loss"));
        publish_alert(ov, uv, pl, false);
        Debug_Print("[PROT] Voltage fault — pump OFF\r\n");
        return;
    } */

    /* dry run detection disabled until current sensor wiring verified
    if (relay1 && !dry_run_tripped && cfg_dry_en)
    {
        if (i < cfg_dry_i)
        {
            dry_run_count++;
            if (dry_run_count >= (uint8_t)cfg_dry_t)
            {
                dry_run_tripped = true;
                lockout_until = HAL_GetTick() + LOCKOUT_MS;
                Relay1_Set(false);
                Relay2_Set(true);
                log_relay_event(1, false, "dry_run");
                publish_alert(false, false, false, true);
                Debug_Print("[PROT] Dry run — pump OFF + lockout\r\n");
            }
        }
        else
        {
            dry_run_count = 0;
        }
    }

