chenyurong22/STM32-EC200-Firmware/src/modem.c
    if (dry_run_tripped && HAL_GetTick() >= lockout_until)
    {
        dry_run_tripped = false;
        dry_run_count = 0;
        Relay2_Set(false);
        publish_alert(false, false, false, false);
        Debug_Print("[PROT] Lockout cleared\r\n");
    } */
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON field extractor  — extracts integer value for a key
 * e.g. extract_int("{\"relay1\":1,\"relay2\":0}", "relay1") → 1
 * ═══════════════════════════════════════════════════════════════════════════ */

static int extract_int(const char *json, const char *key)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":", key);
    const char *p = strstr(json, search);
    if (!p)
        return -1;
    p += strlen(search);
    while (*p == ' ')
        p++;
    return atoi(p);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON float field extractor — returns float value for key, or def if missing
 * ═══════════════════════════════════════════════════════════════════════════ */

/* Lightweight float parser — avoids newlib strtod() bloat (~15 KB).
 * Handles formats like "1.5", "480", "-2.3". */
static float parse_float_lite(const char *s)
{
    while (*s == ' ') s++;
    float sign = 1.0f;
    if (*s == '-') { sign = -1.0f; s++; }
    float result = 0.0f;
    while (*s >= '0' && *s <= '9') { result = result * 10.0f + (*s++ - '0'); }
    if (*s == '.') {
        s++;
        float frac = 0.1f;
        while (*s >= '0' && *s <= '9') { result += (*s++ - '0') * frac; frac *= 0.1f; }
    }
    return sign * result;
}

static float extract_float(const char *json, const char *key, float def)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":", key);
    const char *p = strstr(json, search);
    if (!p) return def;
    p += strlen(search);
    while (*p == ' ') p++;
    return parse_float_lite(p);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON string field extractor — copies value of "key":"<value>" into out
 * Returns true if key was found and value is non-empty.
 * ═══════════════════════════════════════════════════════════════════════════ */

static bool extract_str(const char *json, const char *key, char *out, size_t max)
{
    char search[40];
    snprintf(search, sizeof(search), "\"%s\":\"", key);
    const char *p = strstr(json, search);
    if (!p) return false;
    p += strlen(search);
    size_t i = 0;
    while (*p && *p != '"' && i < max - 1)
        out[i++] = *p++;
    out[i] = '\0';
    return (i > 0);
}

/* Accept OTA trigger payloads in either format:
 *   {"url":"https://..."}   or   https://...
 * Extract URL from any line containing http/https text. */
static bool extract_ota_url_any(const char *text, char *out, size_t max)
{
    const char *p = strstr(text, "https://");
    if (!p) p = strstr(text, "http://");
    if (!p) return false;

    size_t i = 0;
    while (*p && i < max - 1) {
        char c = *p;
        if (c == '"' || c == ',' || c == ' ' || c == '\r' || c == '\n')
            break;
        out[i++] = c;
        p++;
    }
    out[i] = '\0';
    return (i > 0);
}

static void modem_ota_start(const char *url); /* forward declaration */
static void modem_ota_publish(const char *topic, const char *payload); /* forward declaration */
static bool modem_is_exact_reboot_urc(const char *line);

/* Apply protection settings from JSON payload */
static void apply_settings(const char *json)
{
    float v;
    int   t;
    v = extract_float(json, "ov",    cfg_ov);    if (v > 0.0f) cfg_ov    = v;
    v = extract_float(json, "uv",    cfg_uv);    if (v > 0.0f) cfg_uv    = v;
    v = extract_float(json, "pl",    cfg_pl);    if (v > 0.0f) cfg_pl    = v;
    v = extract_float(json, "dry_i", cfg_dry_i); if (v > 0.0f) cfg_dry_i = v;
    t = extract_int(json, "dry_t");              if (t > 0)    cfg_dry_t = t;
    t = extract_int(json, "hp");                 if (t > 0)    cfg_hp     = t;
    if (strstr(json, "\"dry_en\":"))             cfg_dry_en = extract_int(json, "dry_en") ? 1 : 0;
    Debug_Print("[CFG] Settings updated\r\n");
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Line processor — called for every complete line received from EC200U
 * ═══════════════════════════════════════════════════════════════════════════ */

static void process_line(const char *line)
{
    char dbg[80];

    /* ── always log non-empty lines to debug UART ── */
    if (line[0] && MODEM_TRACE_LINES)
    {
        snprintf(dbg, sizeof(dbg), "[EC200U] %s\r\n", line);
        Debug_Print(dbg);
    }

    /* Modem restarted unexpectedly (brownout/reset): all runtime MQTT/SSL
     * config is lost. Schedule a full Modem_Init() instead of partial retry.
     * Suppress during the 20s grace period after Modem_Init — late boot URCs
     * (APP RDY, +CFUN: 1) from the AT+CFUN=1,1 OTA reboot path must not
     * trigger a spurious re-init.                                            */
    if (!OTA_IsActive() &&
        modem_is_exact_reboot_urc(line) &&
        mqtt_state != MQTT_STATE_BOOT &&
        (int32_t)(HAL_GetTick() - modem_init_grace_until) >= 0)
    {
        modem_reinit_pending = true;
        Debug_Print("[MODEM] Unsolicited modem reboot detected\r\n");
    }

    /* Forward ALL lines to OTA state machine during an active OTA download.
     * OTA_HandleLine() handles HTTP/file URCs (+QHTTPGET, +QFOPEN, CONNECT).
     * Return early so MQTT logic doesn't misinterpret AT responses as MQTT. */
    if (OTA_IsActive())
    {
        OTA_HandleLine(line);
        return;
    }

    /* +QMTRECV: incoming command — handle in ANY state that has an active
     * MQTT session so relay commands work even during PUBLISHING/PUB_WAIT_OK.
     * Some EC200U firmware versions put the JSON payload on the SAME line:
     *   +QMTRECV: 0,0,"pump/01/cmd","{"relay1":1,"relay2":0}"
     * Others put it on the NEXT line (split format):
     *   +QMTRECV: 0,0,"pump/01/cmd",23
     *   {"relay1":1,"relay2":0}
     * The recv_payload_pending flag handles the split-line case.             */

