chenyurong22/STM32-EC200-Firmware/src/modem.c
    /* ── PHASE 1: everything done while MQTT is still connected ──────────────
     *
     * Key insight: AT+QHTTPURL only stores the URL in RAM — it does NOT start
     * a TLS handshake or any network activity.  The TLS/TCP connection only
     * happens later during AT+QHTTPGET.
     *
     * By doing SSL config, QHTTPCFG, and QHTTPURL while MQTT is connected, any
     * failure (ERROR / timeout) can be published to Firebase immediately via the
     * live MQTT connection — no reconnect cycle needed.
     *
     * AT+QHTTPGET is the only command that cannot coexist with MQTT TLS
     * (EC200U cannot run two simultaneous TLS sessions), so MQTT disconnect
     * is deferred until just before AT+QHTTPGET.                            */

    /* Publish "starting" — tells bridge.js to clear the retained OTA message
     * on pump/01/ota so the board doesn't re-trigger OTA on every reconnect. */
    /* Publish "starting" even if a status heartbeat is mid-flight.
     * The retained pump/01/ota message often arrives while mqtt_state is
     * PUBLISHING or PUB_WAIT_OK (connection heartbeat queued immediately on
     * CONNECTED).  Wait 700 ms for the in-progress publish to complete, then
     * flush stale modem bytes before sending our own AT+QMTPUBEX.            */
    if (mqtt_state == MQTT_STATE_CONNECTED  ||
        mqtt_state == MQTT_STATE_PUBLISHING ||
        mqtt_state == MQTT_STATE_PUB_WAIT_OK) {
        HAL_Delay(700);                        /* let previous publish finish */
        HAL_IWDG_Refresh(&hiwdg);
        { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }

        const char *ota_payload = "{\"ota_status\":\"starting\"}";
        char pub_cmd[80];
        snprintf(pub_cmd, sizeof(pub_cmd),
                 "AT+QMTPUBEX=0,0,0,0,\"pump/01/ota/status\",%d",
                 (int)strlen(ota_payload));
        modem_cmd(pub_cmd);
        uint8_t c;
        uint32_t t0 = HAL_GetTick();
        bool got_prompt = false;
        while (HAL_GetTick() - t0 < 3000) {
            if (HAL_UART_Receive(modem_uart, &c, 1, 5) == HAL_OK && c == '>') {
                got_prompt = true; break;
            }
        }
        if (got_prompt) {
            HAL_UART_Transmit(modem_uart, (uint8_t*)ota_payload,
                              strlen(ota_payload), 1000);
            uint8_t ctrlz = 0x1A;  /* Ctrl-Z commits the MQTT publish */
            HAL_UART_Transmit(modem_uart, &ctrlz, 1, 1000);
            HAL_Delay(500);        /* wait for modem to process publish */
            /* Flush +QMTPUBEX response so it doesn't interfere with SSL cmds */
            { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }
        }
        HAL_IWDG_Refresh(&hiwdg);
    }

    /* SSL context 1 — used by HTTP client (independent of context 0 = MQTT).
     * Re-applied here because AT+QIDEACT (from a previous reconnect) resets
     * QSSLCFG RAM settings.                                                 */
    modem_cmd("AT+QSSLCFG=\"sslversion\",1,4");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"seclevel\",1,0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    /* EC200U HTTPS servers behind CDN (e.g., GitHub raw) typically require
     * TLS SNI and can reject handshake when modem RTC is stale. */
    if (have_ota_host) {
        char sni_cmd[160];
        snprintf(sni_cmd, sizeof(sni_cmd), "AT+QSSLCFG=\"sni\",1,\"%s\"", ota_host);
        modem_cmd(sni_cmd);
    } else {
        modem_cmd("AT+QSSLCFG=\"sni\",1,1");
    }
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"ignorelocaltime\",1,1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"contextid\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"sslctxid\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    /* Without "ssl",1 the HTTP client uses plain TCP even for https:// URLs.
     * The TLS handshake never happens and GitHub returns a connection error. */
    modem_cmd("AT+QHTTPCFG=\"ssl\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd(OTA_HTTP_REDIRECT_ENABLED ? "AT+QHTTPCFG=\"redirect\",1"
                                        : "AT+QHTTPCFG=\"redirect\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"responseheader\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"requestheader\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);

    /* Stop any lingering HTTP session and delete any leftover file from a
     * previous failed OTA attempt.  AT+QHTTPGET auto-saves the response to
     * "HTTP_GETFILE" on EC200U UFS (no drive prefix).  Delete it first so
     * stale content cannot be flashed if a previous download was incomplete.
     * Errors from both commands are ignored. */
    modem_cmd("AT+QHTTPSTOP");
    HAL_Delay(500);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QFDEL=\"HTTP_GETFILE\"");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }
    HAL_IWDG_Refresh(&hiwdg);

    /* Set URL.  Use a 5-second input window so the modem exits URL-input mode
     * before modem_sync_expect (10 s) returns — keeps the modem in a clean
     * command-mode state on failure.                                         */
    char urlcmd[32];
    snprintf(urlcmd, sizeof(urlcmd), "AT+QHTTPURL=%d,5", (int)strlen(url));
    modem_cmd(urlcmd);

    if (!modem_sync_expect("CONNECT", 10000)) {
        /* URL setup failed — MQTT is still connected.  Publish error directly
         * via queue_publish so it appears in Firebase within seconds.
         * No reconnect needed; just return and let the main loop resume.    */
        char errbuf[80];
        snprintf(errbuf, sizeof(errbuf),
                 "{\"ota_status\":\"error\",\"reason\":\"no CONNECT: %s\"}", modem_last_resp);
        pub_pending = false;
        queue_publish("pump/01/ota/status", errbuf);
        return;   /* MQTT still connected — normal operation resumes         */
    }

    /* Send URL bytes (no \r\n — modem counts exact bytes) */
    Modem_Send(url);
    HAL_IWDG_Refresh(&hiwdg);

    if (!modem_sync_expect("OK", 10000)) {
        char errbuf[80];
        snprintf(errbuf, sizeof(errbuf),
                 "{\"ota_status\":\"error\",\"reason\":\"URL rejected: %s\"}", modem_last_resp);
        pub_pending = false;
        queue_publish("pump/01/ota/status", errbuf);
        return;   /* MQTT still connected                                    */
    }
    HAL_IWDG_Refresh(&hiwdg);

