chenyurong22/STM32-EC200-Firmware/src/modem.c
    /* ── PHASE 2: disconnect MQTT, full modem reset, restart download ───────
     *
     * Problem: AT+QFOPEN is silently ignored after a previous failed QFOPEN
     * attempt.  The EC200U's UFS file system mutex gets stuck and the only
     * command that clears it is AT+CFUN=1,1 (full modem software reset).
     * QIDEACT+QIACT frees TLS RAM (fixes 729) but does NOT clear the FS
     * mutex.  CFUN=1,1 fixes both.
     *
     * Since CFUN=1,1 wipes all modem config (SSL, HTTP, URL), we call
     * OTA_Start() instead of OTA_StartFromGet() so the state machine
     * re-applies SSL context and URL from scratch on the clean modem.      */
    modem_cmd("AT+QMTDISC=0");
    HAL_Delay(500);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QMTCLOSE=0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);

    Debug_Print("[OTA] CFUN=1,1 — full modem reset to clear UFS/TLS state\r\n");
    modem_cmd("AT+CFUN=1,1");
    modem_sync_expect("RDY", 30000);          /* wait up to 30 s for modem  */
    IWDG->KR = 0xAAAAU;
    for (int _i = 0; _i < 30; _i++) {        /* 15 s: SIM CPIN + network   */
        HAL_Delay(500); IWDG->KR = 0xAAAAU;
    }
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 200) == HAL_OK) {} }
    IWDG->KR = 0xAAAAU;

    modem_sync_cmd_ok("ATE0", 2000, 5);       /* disable echo after reset   */

    /* Reactivate PDP context — retry up to 3× in case network not ready   */
    for (int _a = 0; _a < 3; _a++) {
        modem_cmd("AT+QIACT=1");
        if (modem_sync_expect("OK", 15000)) break;
        for (int _i = 0; _i < 6; _i++) {     /* 3 s between retries        */
            HAL_Delay(500); IWDG->KR = 0xAAAAU;
        }
    }
    modem_sync_cmd_ok("AT+QIDNSCFG=1,\"8.8.8.8\",\"8.8.4.4\"", 3000, 2);
    HAL_IWDG_Refresh(&hiwdg);

    /* Re-sync parser and configure HTTP/TLS synchronously after CFUN reset.
     * This avoids async SSL state races right after reboot. */
    if (!modem_sync_cmd_ok("AT", 2000, 8))
        Debug_Print("[OTA] WARN: AT sync before OTA HTTP cfg failed\r\n");
    modem_sync_cmd_ok("ATE0", 2000, 3);
    HAL_Delay(300); IWDG->KR = 0xAAAAU;

    modem_sync_cmd_ok("AT+QSSLCFG=\"sslversion\",1,4", 3000, 3);
    modem_sync_cmd_ok("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF", 3000, 3);
    modem_sync_cmd_ok("AT+QSSLCFG=\"seclevel\",1,0", 3000, 3);
    if (have_ota_host) {
        char sni_cmd2[160];
        snprintf(sni_cmd2, sizeof(sni_cmd2), "AT+QSSLCFG=\"sni\",1,\"%s\"", ota_host);
        modem_sync_cmd_ok(sni_cmd2, 3000, 3);
    } else {
        modem_sync_cmd_ok("AT+QSSLCFG=\"sni\",1,1", 3000, 3);
    }
    modem_sync_cmd_ok("AT+QSSLCFG=\"ignorelocaltime\",1,1", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"contextid\",1", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"sslctxid\",1", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"ssl\",1", 3000, 3);
    modem_sync_cmd_ok(OTA_HTTP_REDIRECT_ENABLED ? "AT+QHTTPCFG=\"redirect\",1"
                                                : "AT+QHTTPCFG=\"redirect\",0",
                     3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"responseheader\",0", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"requestheader\",0", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPSTOP", 3000, 2);
    modem_cmd("AT+QFDEL=\"HTTP_GETFILE\"");  /* may fail if file absent */
    HAL_Delay(300); IWDG->KR = 0xAAAAU;
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 100) == HAL_OK) {} }

    /* Set URL synchronously, then jump OTA state machine to QHTTPGET. */
    {
        char urlcmd2[32];
        snprintf(urlcmd2, sizeof(urlcmd2), "AT+QHTTPURL=%d,5", (int)strlen(url));
        modem_cmd(urlcmd2);
        if (!modem_sync_expect("CONNECT", 10000)) {
            queue_publish("pump/01/ota/status",
                          "{\"ota_status\":\"error\",\"reason\":\"no CONNECT (post-cfun)\"}");
            return;
        }
        Modem_Send(url);
        if (!modem_sync_expect("OK", 10000)) {
            queue_publish("pump/01/ota/status",
                          "{\"ota_status\":\"error\",\"reason\":\"URL reject (post-cfun)\"}");
            return;
        }
    }

    mqtt_state = MQTT_STATE_DISCONNECTED;
    HAL_IWDG_Refresh(&hiwdg);

    /* URL + HTTP config are already set above; start directly from GET. */
    OTA_StartFromGet(url);
}

/* ── OTA publish callback — lets ota.c publish via MQTT ─────────────────── */
static void modem_ota_publish(const char *topic, const char *payload)
{
    (void)topic;  /* topic always pump/01/ota/status — matches ota_error_msg path */

    /* Only save meaningful OTA status updates to ota_error_msg so they
     * survive MQTT disconnect+reconnect.  Skip ota_debug trace lines —
     * they are published for every received AT line during download and
     * would clobber the real error/success status before MQTT reconnects.*/
    if (strstr(payload, "\"ota_status\"")) {
        strncpy(ota_error_msg, payload, sizeof(ota_error_msg) - 1);
        ota_error_msg[sizeof(ota_error_msg) - 1] = '\0';
    }

    if (strstr(payload, "modem rebooted during ota")) {
        ota_retry_block_until = HAL_GetTick() + OTA_RETRY_BLOCK_MS;
        Debug_Print("[OTA] Cooldown armed after modem reboot during OTA\r\n");
    }

    pub_pending = false;
    queue_publish("pump/01/ota/status", payload);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Modem_Init  — called once from main.c after UART init
 * ═══════════════════════════════════════════════════════════════════════════ */

void Modem_Init(UART_HandleTypeDef *huart)
{
    modem_uart = huart;
    rxpos = 0;
    mqtt_state = MQTT_STATE_BOOT;
    state_entered_ms = HAL_GetTick();

    Debug_Print("\r\n=== EC200U MQTT Pump Controller ===\r\n");
    Debug_Print("[MODEM] Pump ID : " PUMP_ID "\r\n");
    Debug_Print("[MODEM] Broker  : " BROKER_HOST "\r\n");
    Debug_Print("[MODEM] Waiting for EC200U ready...\r\n");

    /* Detect software reset (NVIC_SystemReset after OTA) vs cold power-on.
     * RCC_CSR_SFTRSTF is set by NVIC_SystemReset; PORRSTF is set on power-on.
     * Used below to choose the initial MQTT state. */
    uint32_t reset_csr = RCC->CSR;
    bool ota_reboot = ((reset_csr & RCC_CSR_SFTRSTF) != 0) && OTA_WasRebootPending();
    {
        char dbg[96];
        snprintf(dbg, sizeof(dbg), "[MODEM] Reset CSR: 0x%08lX\r\n", (unsigned long)reset_csr);
        Debug_Print(dbg);
    }
    modem_log_reset_flags(reset_csr);
    RCC->CSR |= RCC_CSR_RMVF;   /* clear reset-cause flags for next check */

    if (ota_reboot) {
        /* Check OTA flags to determine if the bootloader applied the update.
         * Bootloader erases the flags page (all bytes → 0xFF) after a
         * successful App B → App A copy.  If the flags magic is still
         * OTA_MAGIC the bootloader CRC check failed and old App A is kept.  */
        volatile uint32_t *flags_magic = (volatile uint32_t*)OTA_FLAGS_ADDR;
        if (*flags_magic == 0xFFFFFFFFUL) {
            /* Erased flags = bootloader ran + copy succeeded → new firmware */
            strncpy(ota_error_msg, "{\"ota_status\":\"success\"}",
                    sizeof(ota_error_msg) - 1);
            ota_error_msg[sizeof(ota_error_msg) - 1] = '\0';
            Debug_Print("[OTA] New firmware running — will publish success\r\n");
        } else {
            /* Flags still present = bootloader CRC check failed, old App A kept */
            strncpy(ota_error_msg, "{\"ota_status\":\"error\",\"reason\":\"crc_fail\"}",
                    sizeof(ota_error_msg) - 1);
            ota_error_msg[sizeof(ota_error_msg) - 1] = '\0';
            Debug_Print("[OTA] Post-OTA: bootloader CRC fail — old firmware kept\r\n");
        }
        /* AT+QHTTPSTOP does NOT fully free the TLS context-1 heap on the
         * EC200U after an HTTPS OTA download.  Without clearing it,
         * AT+QMTOPEN cannot allocate SSL buffers for MQTT context 0 and
         * MQTT never reconnects after OTA (confirmed: QMTOPEN? returns
         * just "OK" — no active session).  AT+CFUN=1,1 performs a full
         * modem software reset which clears all TLS heap.
         * OTA_IsActive() returns true during OTA_ST_REBOOT so the
         * DISCONNECTED auto-reconnect block cannot fire during cleanup.  */
        Debug_Print("[MODEM] OTA reboot — AT+CFUN=1,1 to clear TLS heap\r\n");
        modem_cmd("AT+CFUN=1,1");
        /* Wait up to 30 s for the "RDY" URC signalling modem restart done.
         * modem_sync_expect() pets IWDG every 1 ms — watchdog safe.       */
        bool rdy_seen = modem_sync_expect("RDY", 30000);
        (void)rdy_seen;
        /* 10 s additional settle: SIM CPIN, partial network registration   */
        for (int i = 0; i < 20; i++) { HAL_Delay(500); IWDG->KR = 0xAAAAU; }
        { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 100) == HAL_OK) {} }
        IWDG->KR = 0xAAAAU;
        Debug_Print("[MODEM] CFUN reset + settle complete\r\n");
    } else {
        /* Cold boot — EC200U powers on and takes ~5 s before it accepts AT. */
        for (int i = 0; i < 10; i++) { HAL_Delay(500); IWDG->KR = 0xAAAAU; }
    }
    if (!modem_sync_cmd_ok("AT", 2000, 15))
        Debug_Print("[MODEM] WARN: AT sync failed, continuing\r\n");
    if (!modem_sync_cmd_ok("ATE0", 2000, 5))
        Debug_Print("[MODEM] WARN: ATE0 failed, continuing\r\n");
    /* Lock CEREG URC mode to 0 so AT+CEREG? always returns "+CEREG: 0,<stat>".
     * After an OTA reboot the modem may retain mode=1 or 2 from a previous
     * session, changing the response format and preventing NET_WAIT from
     * recognising the registration status.                                   */
    if (!modem_sync_cmd_ok("AT+CEREG=0", 2000, 5))
        Debug_Print("[MODEM] WARN: CEREG mode set failed, continuing\r\n");

    /* SSL context 1 — used by HTTP client for HTTPS OTA downloads.
     * Must be separate from context 0 (MQTT) so the broker SNI doesn't
     * interfere with GitHub/CDN TLS handshake.                             */
    modem_cmd("AT+QSSLCFG=\"sslversion\",1,4");
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF");
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"seclevel\",1,0");   /* no cert verify for testing */
    HAL_Delay(300);
    /* HTTP client: use SSL context 1, follow GitHub → CDN redirects */
    modem_cmd("AT+QHTTPCFG=\"sslctxid\",1");
    HAL_Delay(300);
    modem_cmd("AT+QHTTPCFG=\"redirect\",1");
    HAL_Delay(300);

    IWDG->KR = 0xAAAAU;   /* ~3 s elapsed since last pet — refresh before long delays */

