chenyurong22/STM32-EC200-Firmware/src/modem.c
        /* OTA binary passthrough — raw bytes from AT+QFREAD/QHTTPREAD */
        if (OTA_BinaryPending()) {
            OTA_FeedByte(c);
            continue;
        }

        if (c == '\r')
            continue;

        /* '>' is the publish prompt — not followed by '\n', catch it here */
                if (c == '>')
        {
            if (mqtt_state == MQTT_STATE_PUBLISHING && pub_pending)
            {
                /* Send payload immediately � any blocking delay here risks
                 * the modem aborting the input window.                     */
                HAL_UART_Transmit(modem_uart,
                                  (uint8_t *)pub_payload, strlen(pub_payload), 3000);
                /* Ctrl-Z commits the message */
                uint8_t ctrlz = 0x1A;
                HAL_UART_Transmit(modem_uart, &ctrlz, 1, 1000);
                mqtt_state = MQTT_STATE_PUB_WAIT_OK;
                state_entered_ms = HAL_GetTick();
            }
            rxpos = 0;
            continue;
        }

        if (c == '\n')
        {
            rxbuf[rxpos] = '\0';
            if (rxpos > 0)
                process_line(rxbuf);
            rxpos = 0;
        }
        else
        {
            if (rxpos < RX_BUF_SIZE - 1)
                rxbuf[rxpos++] = (char)c;
            else
                rxpos = 0; /* overflow guard */
        }
    }

    /* Full modem reset recovery path: re-run Modem_Init so SSL/MQTT config
     * is restored before attempting any reconnect. */
    if (modem_reinit_pending && !OTA_IsActive()) {
        modem_reinit_pending = false;
        recv_payload_pending = false;
        pub_pending = false;
        OTA_Init();
        Modem_Init(modem_uart);
        return;
    }

    /* ── send AT+QIACT=1 after buffer is drained (avoids stale QMTCLOSE/QIDEACT OK) ── */
    if (mqtt_state == MQTT_STATE_PDP_ACTIVATE && !qiact_sent)
    {
        qiact_sent = true;
        modem_cmd("AT+QIACT=1");
    }

    /* ── send AT+QICSGP after buffer is drained (avoids spurious CGREG OK) ── */
    if (mqtt_state == MQTT_STATE_PDP_OPEN && !qicsgp_sent)
    {
        qicsgp_sent = true;
        char apn_cmd[80];
        snprintf(apn_cmd, sizeof(apn_cmd),
                 "AT+QICSGP=1,1,\"%s\",\"\",\"\",0", SIM_APN);
        modem_cmd(apn_cmd);
    }

    /* ── BOOT heartbeat: keep probing modem until first RDY/OK is seen ── */
    if (mqtt_state == MQTT_STATE_BOOT &&
        (HAL_GetTick() - state_entered_ms) > 3000U)
    {
        Debug_Print("[MODEM] BOOT probe: AT\r\n");
        modem_cmd("AT");
        state_entered_ms = HAL_GetTick();
    }

    /* ── BROKER_OPEN / CONNECTING / SUBSCRIBING timeouts → reconnect ── */
    if ((mqtt_state == MQTT_STATE_BROKER_OPEN ||
         mqtt_state == MQTT_STATE_CONNECTING  ||
         mqtt_state == MQTT_STATE_SUBSCRIBING) &&
        HAL_GetTick() - state_entered_ms > 30000)
    {
        Debug_Print("[MQTT] Connection timeout — reconnecting\r\n");
        if (mqtt_state == MQTT_STATE_BROKER_OPEN) blink_n(1); /* 1 blink = BROKER_OPEN timed out */
        mqtt_state = MQTT_STATE_DISCONNECTED;
    }

    /* ── PUBLISHING timeout — no '>' within 10s means connection is dead ── */
    if (mqtt_state == MQTT_STATE_PUBLISHING &&
        HAL_GetTick() - state_entered_ms > 10000)
    {
        Debug_Print("[MQTT] Publish timeout — reconnecting\r\n");
        pub_pending = false;
        mqtt_state = MQTT_STATE_DISCONNECTED;
    }

    /* ── PUB_WAIT_OK timeout — if +QMTPUBEX never arrives, back to CONNECTED ── */
    if (mqtt_state == MQTT_STATE_PUB_WAIT_OK &&
        HAL_GetTick() - state_entered_ms > MQTT_PUBACK_TIMEOUT_MS)
    {
        Debug_Print("[MQTT] PubWaitOK timeout — continuing\r\n");
        pub_pending = false;
        mqtt_state = MQTT_STATE_CONNECTED;
    }

    /* ── periodic tasks (only when fully connected) ── */
    if (mqtt_state == MQTT_STATE_CONNECTED && !OTA_IsActive())
    {

        /* publish on state change — relay or dry-run trip changed */
        if (!pub_pending &&
            (relay1 != prev_relay1 || relay2 != prev_relay2 ||
             dry_run_tripped != prev_dry_run_trip))
        {
            bool relay2_changed = (relay2 != prev_relay2);
            prev_relay1       = relay1;
            prev_relay2       = relay2;
            prev_dry_run_trip = dry_run_tripped;
            publish_status();
            if (relay2_changed) publish_status2();
        }

        /* heartbeat every 60 s — keeps Firebase online:true fresh */
        if (HAL_GetTick() - last_heartbeat_ms >= HEARTBEAT_INTERVAL_MS)
        {
            last_heartbeat_ms = HAL_GetTick();
            modem_cmd("AT+CSQ"); /* refresh signal strength; +CSQ updates last_rssi */
            publish_status();
        }

        /* run protection every 1 s */
        static uint32_t last_prot_ms = 0;
        if (HAL_GetTick() - last_prot_ms >= 1000)
        {
            last_prot_ms = HAL_GetTick();
            run_protection();
        }
    }

    /* ── send OTA error (saved across reconnect) as soon as MQTT is up ── */
    if (ota_error_msg[0] && mqtt_state == MQTT_STATE_CONNECTED)
    {
        pub_pending = false; /* prioritize OTA result over queued heartbeat */
        queue_publish("pump/01/ota/status", ota_error_msg);
        ota_error_msg[0] = '\0';
        force_status_after_ota = true;
    }

    if (force_status_after_ota &&
        mqtt_state == MQTT_STATE_CONNECTED &&
        !OTA_IsActive() &&
        !pub_pending)
    {
        modem_cmd("AT+CSQ");
        publish_status();
        force_status_after_ota = false;
    }

    /* Feed once more after draining RX loop. */
    HAL_IWDG_Refresh(&hiwdg);

    /* ── send queued publish when connected and idle (not during OTA) ── */
    if (pub_pending && mqtt_state == MQTT_STATE_CONNECTED && !OTA_IsActive())
    {
        char pub_cmd[128];
        snprintf(pub_cmd, sizeof(pub_cmd),
                 "AT+QMTPUBEX=0,0,0,0,\"%s\",%d",  /* QoS=0: msgID must be 0 */
                 pub_topic, (int)strlen(pub_payload));
        modem_cmd(pub_cmd);
        mqtt_state = MQTT_STATE_PUBLISHING;
        state_entered_ms = HAL_GetTick();
    }

